bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                    // Send response back to client
                    benOS_dnsUdp.beginPacket(remoteIP, remotePort);
                    benOS_dnsUdp.write(response, responseLen);
                    benOS_dnsUdp.endPacket();
                    
                    Serial.println("  Forwarded response");
                    break;
                }
                delay(10);
            }
        }
    }
}

void benOS_startDNSServer(TFT_eSPI &tft) {
    if (benOS_dnsServerRunning) {
        benOS_clearScreen(tft);
        benOS_addLine("DNS Server Status");
        benOS_addLine("===================");
        benOS_addLine("Already running!");
        benOS_addLine("");
        benOS_addLine("SSID: BenOS-DNS");
        benOS_addLine("IP: " + benOS_apIP.toString());
        benOS_addLine("Overrides: " + String(benOS_numDNSOverrides));
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_clearScreen(tft);
    benOS_addLine("Starting DNS Server");
    benOS_addLine("===================");
    benOS_redrawScreen(tft);
    
    // Connect to WiFi for forwarding
    benOS_addLine("Connecting to WiFi...");
    benOS_redrawScreen(tft);
    
    if (WiFi.status() != WL_CONNECTED) {
        WiFi.mode(WIFI_STA);
        WiFi.begin(BenOS_Config::WIFI_SSID, BenOS_Config::WIFI_PASS);
        
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20) {
            delay(500);
            attempts++;
        }
        
        if (WiFi.status() != WL_CONNECTED) {
            benOS_addLine("WiFi failed!");
            benOS_addLine("Can't forward DNS");
            benOS_redrawScreen(tft);
            delay(3000);
            return;
        }
    }
    
    benOS_addLine("WiFi connected!");
    benOS_redrawScreen(tft);
    delay(1000);
    
    // Load overrides
    benOS_clearScreen(tft);
    benOS_addLine("Loading overrides...");
    benOS_redrawScreen(tft);
    
    benOS_loadDNSOverrides();
    benOS_addLine("Loaded: " + String(benOS_numDNSOverrides));
    benOS_redrawScreen(tft);
    delay(1000);
    
    // Start AP
    benOS_clearScreen(tft);
    benOS_addLine("Starting AP...");
    benOS_redrawScreen(tft);
    
// Start UDP DNS server listening on all interfaces
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAPConfig(benOS_apIP, benOS_apIP, IPAddress(255, 255, 255, 0));
    WiFi.softAP("BenOS-DNS", "benOS123");
    
    delay(1000);
    
    // Bind UDP to listen on all interfaces (0.0.0.0)
    Serial.println("Starting DNS UDP server...");
    if (!benOS_dnsUdp.begin(DNS_PORT)) {
        Serial.println("ERROR: Failed to start UDP server on port 53!");
        benOS_addLine("ERROR: UDP bind failed!");
        benOS_addLine("Port 53 may be in use");
        benOS_redrawScreen(tft);
        delay(3000);
        return;
    }
    
    Serial.print("DNS UDP listening on port ");
    Serial.println(DNS_PORT);
    Serial.println("  Station IP: " + WiFi.localIP().toString());
    Serial.println("  AP IP: " + benOS_apIP.toString());
    
    benOS_forwardUdp.begin(5353);  // Local port for forwarding
    
    benOS_dnsServerRunning = true;
    
benOS_clearScreen(tft);
    benOS_addLine("DNS Server Running!");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("OPTION 1: Same Network");
    benOS_addLine("(Recommended)");
    benOS_addLine("");
    benOS_addLine("Stay on your WiFi");
    benOS_addLine("Set phone DNS to:");
    benOS_addLine("  >> " + WiFi.localIP().toString() + " <<");
    benOS_addLine("");
    benOS_addLine("========================");
    benOS_addLine("");
    benOS_addLine("OPTION 2: Direct Connect");
    benOS_addLine("Connect to: BenOS-DNS");
    benOS_addLine("Password: benOS123");
    benOS_addLine("Set DNS to: 192.168.4.1");
    benOS_addLine("(Limited - DNS only)");
    benOS_addLine("");
    benOS_addLine("Overrides: " + String(benOS_numDNSOverrides));
    benOS_redrawScreen(tft);
    
Serial.println("\n=== DNS Server Started ===");
    Serial.println("Station IP (use this for DNS): " + WiFi.localIP().toString());
    Serial.println("AP SSID: BenOS-DNS / Password: benOS123");
    Serial.println("AP IP: " + benOS_apIP.toString());
    Serial.println("DNS listening on UDP port 53");
    Serial.println("Overrides loaded: " + String(benOS_numDNSOverrides));
}

void benOS_stopDNSServer(TFT_eSPI &tft) {
    if (!benOS_dnsServerRunning) {
        benOS_clearScreen(tft);
        benOS_addLine("DNS server not running");
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_clearScreen(tft);
    benOS_addLine("Stopping DNS Server...");
    benOS_redrawScreen(tft);
    
    benOS_dnsUdp.stop();
    benOS_forwardUdp.stop();
    
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    
    benOS_dnsServerRunning = false;
    benOS_numDNSOverrides = 0;
    
    benOS_addLine("DNS server stopped");
    benOS_redrawScreen(tft);
    
    Serial.println("DNS Server stopped");
    delay(1000);
}

void benOS_dnsServerStatus(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("DNS Server Status");
    benOS_addLine("===================");
    benOS_addLine("");
    
    if (benOS_dnsServerRunning) {
        benOS_addLine("Status: RUNNING");
        benOS_addLine("");
        benOS_addLine("AP Info:");
        benOS_addLine("  SSID: BenOS-DNS");
        benOS_addLine("  IP: " + benOS_apIP.toString());
        benOS_addLine("  Clients: " + String(WiFi.softAPgetStationNum()));
        benOS_addLine("");
        benOS_addLine("Overrides: " + String(benOS_numDNSOverrides));
        
        if (benOS_numDNSOverrides > 0) {
            benOS_addLine("");
            benOS_addLine("First 3 overrides:");
            for (int i = 0; i < min(3, benOS_numDNSOverrides); i++) {
                benOS_addLine("  " + benOS_dnsOverrides[i].hostname +
                            " -> " + benOS_dnsOverrides[i].ip.toString());
            }
        }
    } else {
        benOS_addLine("Status: STOPPED");
        benOS_addLine("");
        benOS_addLine("Use 'dnsstart' to start");
    }
    
    benOS_redrawScreen(tft);
}

void benOS_syncTime(TFT_eSPI &tft) {
    // WiFi check removed - handled by caller
    
    benOS_addLine("Syncing time...");
    benOS_redrawScreen(tft);
    
    configTime(BenOS_Config::GMT_OFFSET, BenOS_Config::DAYLIGHT_OFFSET, BenOS_Config::NTP_SERVER);
    
    int attempts = 0;
    while (time(nullptr) < 100000 && attempts < 20) {
        delay(500);
        attempts++;
    }
    
    if (time(nullptr) > 100000) {
        benOS_addLine("Time synced!");
        time_t now = time(nullptr);
        struct tm* t = localtime(&now);
        char buf[40];
        sprintf(buf, "%04d-%02d-%02d %02d:%02d:%02d",
                t->tm_year + 1900, t->tm_mon + 1, t->tm_mday,
                t->tm_hour, t->tm_min, t->tm_sec);
        benOS_addLine(buf);
    } else {
        benOS_addLine("Time sync failed.");
    }
    benOS_redrawScreen(tft);
}

