bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
    IPAddress ip;
    unsigned long startTime = millis();
    bool success = WiFi.hostByName(hostname.c_str(), ip);
    unsigned long duration = millis() - startTime;
    
    benOS_clearScreen(tft);
    benOS_addLine("DNS Lookup Results");
    benOS_addLine("========================");
    benOS_addLine("Hostname: " + hostname);
    benOS_addLine("");
    
    if (success) {
        benOS_addLine("Status: SUCCESS");
        benOS_addLine("Query time: " + String(duration) + " ms");
        benOS_addLine("");
        benOS_addLine("Answer:");
        benOS_addLine("  " + hostname);
        benOS_addLine("  IN A " + ip.toString());
        benOS_addLine("");
        
        benOS_addLine("IP Address Details:");
        benOS_addLine("  Decimal: " + ip.toString());
        benOS_addLine("  Hex: 0x" + String(ip[0], HEX) + String(ip[1], HEX) + 
                      String(ip[2], HEX) + String(ip[3], HEX));
        
        String ipClass = "Unknown";
        if (ip[0] < 128) ipClass = "A (Public)";
        else if (ip[0] < 192) ipClass = "B (Public)";
        else if (ip[0] < 224) ipClass = "C (Public)";
        else if (ip[0] < 240) ipClass = "D (Multicast)";
        else ipClass = "E (Reserved)";
        
        if ((ip[0] == 10) ||
            (ip[0] == 172 && ip[1] >= 16 && ip[1] <= 31) ||
            (ip[0] == 192 && ip[1] == 168)) {
            ipClass += " [PRIVATE]";
        }
        
        benOS_addLine("  Class: " + ipClass);
        
    } else {
        benOS_addLine("Status: FAILED");
        benOS_addLine("Query time: " + String(duration) + " ms");
        benOS_addLine("");
        benOS_addLine("Error: Host not found");
        benOS_addLine("");
        benOS_addLine("Possible reasons:");
        benOS_addLine("  - Hostname doesn't exist");
        benOS_addLine("  - DNS server unreachable");
        benOS_addLine("  - Network issue");
    }
    
    benOS_addLine("");
    benOS_addLine("========================");
    benOS_redrawScreen(tft);
}

void benOS_addJSONFormatted(String json) {
    // This is now handled by benOS_displayWithPagination
    // Keep this function for backward compatibility but just wrap the content
    const int maxChars = 38;
    int start = 0;
    
    while (start < json.length()) {
        int end = start + maxChars;
        if (end > json.length()) end = json.length();
        
        // Try to break at sensible points
        if (end < json.length()) {
            int lastComma = json.lastIndexOf(',', end);
            int lastSpace = json.lastIndexOf(' ', end);
            int lastBrace = json.lastIndexOf('}', end);
            
            int breakPoint = max(lastComma, max(lastSpace, lastBrace));
            if (breakPoint > start && (end - breakPoint) < 10) {
                end = breakPoint + 1;
            }
        }
        
        String line = json.substring(start, end);
        line.trim();
        if (line.length() > 0) {
            benOS_addLine(line);
        }
        start = end;
    }
}

// ========== PAGINATED DISPLAY FOR LONG CONTENT ==========

void benOS_displayWithPagination(TFT_eSPI &tft, String content) {
    const int maxChars = 38;  // Slightly shorter for readability
    const int linesPerPage = 12;  // Show 12 lines, leave room for "Press button..."
    
    // Clean up JSON formatting
    content.replace("\r", "");
    content.replace("\\n", " ");
    content.replace("\\\"", "'");
    
    // Break content into lines
    String lines[200];  // Max 200 lines
    int totalLines = 0;
    
    int start = 0;
    while (start < content.length() && totalLines < 200) {
        int end = start + maxChars;
        if (end > content.length()) {
            end = content.length();
        }
        
        // Try to break at a space for readability
        if (end < content.length()) {
            int lastSpace = content.lastIndexOf(' ', end);
            if (lastSpace > start && (end - lastSpace) < 15) {
                end = lastSpace + 1;
            }
        }
        
        lines[totalLines++] = content.substring(start, end);
        start = end;
    }
    
    // Display lines with pagination
    int currentLine = 0;
    
    while (currentLine < totalLines) {
        benOS_clearScreen(tft);
        
        // Show lines for this page
        int linesShown = 0;
        while (linesShown < linesPerPage && currentLine < totalLines) {
            benOS_addLine(lines[currentLine]);
            currentLine++;
            linesShown++;
        }
        
        // Show pagination info
        if (currentLine < totalLines) {
            benOS_addLine("");
            benOS_addLine("--- More content ---");
            benOS_addLine("(" + String(totalLines - currentLine) + " lines remaining)");
            benOS_addLine("Press button to continue...");
        } else {
            benOS_addLine("");
            benOS_addLine("--- End ---");
            benOS_addLine("Press button to continue...");
        }
        
        benOS_redrawScreen(tft);
        
        // Wait for button press
        while (digitalRead(PIN_KO) == LOW) delay(10);
        delay(200);
        
        int lastBtn = HIGH;
        while (true) {
            int btn = digitalRead(PIN_KO);
            if (btn == LOW && lastBtn == HIGH) break;
            lastBtn = btn;
            delay(50);
        }
        
        while (digitalRead(PIN_KO) == LOW) delay(10);
        delay(200);
    }
}

void benOS_curl(TFT_eSPI &tft, String url) {
    // WiFi check removed - handled by caller
    
    benOS_addLine("Fetching...");
    benOS_redrawScreen(tft);
    
    HTTPClient http;
    http.begin(url);
    http.setTimeout(10000);
    
    unsigned long startTime = millis();
    int code = http.GET();
    unsigned long duration = millis() - startTime;
    
    if (code > 0) {
        benOS_clearScreen(tft);
        benOS_addLine("HTTP " + String(code) + " (" + String(duration) + "ms)");
        
        if (code == HTTP_CODE_OK) {
            String payload = http.getString();
            int len = payload.length();
            benOS_addLine("Size: " + String(len) + " bytes");
            benOS_addLine("--- Response ---");
            benOS_redrawScreen(tft);
            
