bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
            delay(500);
            benOS_displayWithPagination(tft, payload);
            
        } else {
            benOS_addLine("Status: " + String(code));
            benOS_redrawScreen(tft);
        }
    } else {
        benOS_clearScreen(tft);
        benOS_addLine("curl: Connection failed");
        benOS_addLine("Error: " + http.errorToString(code));
        benOS_redrawScreen(tft);
    }
    
    http.end();
}

// ========== FILE FUNCTIONS ==========

void benOS_writeFile(TFT_eSPI &tft, String name, String data) {
    File f = SD.open("/" + name, FILE_WRITE);
    if (!f) {
        benOS_addLine("Error writing file.");
        benOS_redrawScreen(tft);
        return;
    }
    f.print(data);
    f.close();
    benOS_addLine("File written: " + name);
    benOS_redrawScreen(tft);
}

void benOS_readFile(TFT_eSPI &tft, String name) {
    File f = SD.open("/" + name);
    if (!f) {
        benOS_addLine("Error reading file.");
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_addLine("=== " + name + " ===");
    while (f.available()) {
        benOS_addLine(f.readStringUntil('\n'));
    }
    f.close();
    benOS_redrawScreen(tft);
}

void benOS_deleteFile(TFT_eSPI &tft, String name) {
    if (SD.remove("/" + name)) {
        benOS_addLine("File deleted: " + name);
    } else {
        benOS_addLine("Error deleting file.");
    }
    benOS_redrawScreen(tft);
}

void benOS_listFiles(TFT_eSPI &tft) {
    File root = SD.open("/");
    if (!root) {
        benOS_addLine("Error opening root dir");
        benOS_redrawScreen(tft);
        return;
    }
    
    benOS_addLine("=== Files on SD ===");
    File file = root.openNextFile();
    while (file) {
        if (!file.isDirectory()) {
            String name = String(file.name());
            int size = file.size();
            benOS_addLine(name + " (" + String(size) + " bytes)");
        }
        file = root.openNextFile();
    }
    benOS_redrawScreen(tft);
}

// ========== CALCULATOR ==========

int benOS_precedence(char op) {
    if (op == '+' || op == '-') return 1;
    if (op == '*' || op == '/' || op == '%') return 2;
    return 0;
}

int benOS_operate(int a, int b, char op) {
    switch (op) {
        case '+': return a + b;
        case '-': return a - b;
        case '*': return a * b;
        case '/': return b ? a / b : 0;
        case '%': return b ? a % b : 0;
    }
    return 0;
}

void benOS_calc(TFT_eSPI &tft, String expression) {
    int values[50];
    char ops[50];
    int vTop = -1, oTop = -1;
    
    for (int i = 0; i < expression.length(); i++) {
        if (expression[i] == ' ') continue;
        
        if (isdigit(expression[i])) {
            int num = 0;
            while (i < expression.length() && isdigit(expression[i])) {
                num = num * 10 + (expression[i] - '0');
                i++;
            }
            i--;
            values[++vTop] = num;
        } else if (expression[i] == '+' || expression[i] == '-' || 
                   expression[i] == '*' || expression[i] == '/' || expression[i] == '%') {
            while (oTop >= 0 && benOS_precedence(ops[oTop]) >= benOS_precedence(expression[i])) {
                int b = values[vTop--];
                int a = values[vTop--];
                char op = ops[oTop--];
                values[++vTop] = benOS_operate(a, b, op);
            }
            ops[++oTop] = expression[i];
        }
    }
    
    while (oTop >= 0) {
        int b = values[vTop--];
        int a = values[vTop--];
        char op = ops[oTop--];
        values[++vTop] = benOS_operate(a, b, op);
    }
    
    benOS_addLine("Result: " + String(values[vTop]));
    benOS_redrawScreen(tft);
}

// ========== JPG DISPLAY WITH AUTO-SCALING ==========

bool benOS_tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t* bitmap, TFT_eSPI* tft) {
    if (y >= tft->height()) return 0;
    tft->pushImage(x, y, w, h, bitmap);
    return 1;
}

void benOS_showImage(TFT_eSPI &tft, const char* filename) {
    if (!SD.exists(filename)) {
        benOS_addLine("Image not found:");
        benOS_addLine(filename);
        benOS_redrawScreen(tft);
        delay(2000);
        return;
    }
    
    tft.fillScreen(TFT_BLACK);
    
    uint8_t scale = 1;
    
    TJpgDec.setJpgScale(scale);
    TJpgDec.setSwapBytes(true);
    TJpgDec.setCallback([](int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t* bitmap) -> bool {
        extern TFT_eSPI tft;
        return benOS_tft_output(x, y, w, h, bitmap, &tft);
    });
    
    uint16_t imgWidth = 0, imgHeight = 0;
    TJpgDec.getSdJpgSize(&imgWidth, &imgHeight, filename);
    
    if (imgWidth > 320 || imgHeight > 240) {
        if (imgWidth > imgHeight) {
            if (imgWidth > 320 * 4) scale = 8;
            else if (imgWidth > 320 * 2) scale = 4;
            else if (imgWidth > 320) scale = 2;
        } else {
            if (imgHeight > 240 * 4) scale = 8;
            else if (imgHeight > 240 * 2) scale = 4;
            else if (imgHeight > 240) scale = 2;
        }
        TJpgDec.setJpgScale(scale);
        imgWidth /= scale;
        imgHeight /= scale;
    }
    
    int xOffset = (320 - imgWidth) / 2;
    int yOffset = (240 - imgHeight) / 2;
    if (xOffset < 0) xOffset = 0;
    if (yOffset < 0) yOffset = 0;
    
    TJpgDec.drawSdJpg(xOffset, yOffset, filename);
    
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextFont(2);
    tft.setTextDatum(BC_DATUM);
    tft.drawString("Press button to return", 160, 230);
    
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
    
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) break;
        lastBtn = btn;
        delay(50);
    }
    
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
}

// ========== THEME SELECTION WITH ROTARY ==========

void benOS_selectTheme(TFT_eSPI &tft) {
    int selected = benOS_currentTheme;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
            tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
            
