bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("Select Theme", 160, 5);
            
            tft.setTextFont(2);
            tft.setTextDatum(CL_DATUM);
            
            for (int i = 0; i < benOS_themeCount; i++) {
                int y = 30 + i * 25;
                
                if (i == selected) {
                    tft.setTextColor(benOS_themes[i].bg, benOS_themes[i].fg);
                    tft.fillRect(5, y - 2, 310, 22, benOS_themes[i].fg);
                } else {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                }
                
                String marker = (i == benOS_currentTheme) ? " *" : "";
                tft.drawString(String(i) + ": " + benOS_themes[i].name + marker, 10, y + 9);
            }
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= benOS_themeCount) selected = benOS_themeCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            benOS_currentTheme = selected;
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            return;
        }
        lastBtn = btn;
        
        delay(50);
    }
}

// ========== HELP ==========

void benOS_showHelp(TFT_eSPI &tft) {
    // Page 1
    benOS_clearScreen(tft);
    benOS_addLine("=== BenOS Commands (1/2) ===");
    benOS_addLine("NETWORK:");
    benOS_addLine("  wifi - Connect to WiFi");
    benOS_addLine("  wifiscan - Scan networks");
    benOS_addLine("  dig - DNS lookup");
    benOS_addLine("  curl - HTTP request");
    benOS_addLine("  ping - Ping host");
    benOS_addLine("  speedtest - Network speed");
    benOS_addLine("  dnsstart/stop/status");
    benOS_addLine("");
    benOS_addLine("SYSTEM:");
    benOS_addLine("  sysinfo - System info");
    benOS_addLine("  time - Show current time");
    benOS_addLine("  synctime - Sync with NTP");
    benOS_addLine("  version - OS version");
    benOS_addLine("");
    benOS_addLine("Press button for more...");
    benOS_redrawScreen(tft);
    
    // Wait for button
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) break;
        lastBtn = btn;
        delay(50);
    }
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
    
    // Page 2
    benOS_clearScreen(tft);
    benOS_addLine("=== BenOS Commands (2/2) ===");
    benOS_addLine("TOOLS:");
    benOS_addLine("  passgen - Password gen");
    benOS_addLine("  qrcode - QR code gen");
    benOS_addLine("  calc - Calculator");
    benOS_addLine("");
    benOS_addLine("INFO:");
    benOS_addLine("  weather - Weather info");
    benOS_addLine("  stocks - Stock prices");
    benOS_addLine("  news - News headlines");
    benOS_addLine("");
    benOS_addLine("MEDIA & FILES:");
    benOS_addLine("  play - Music player");
    benOS_addLine("  fart - Fart soundboard");
    benOS_addLine("  ascii - ASCII art viewer");
    benOS_addLine("  cowsay - Cowsay");
    benOS_addLine("  ls/read/write/delete/image");
    benOS_addLine("");
    benOS_addLine("Press button to continue...");
    benOS_redrawScreen(tft);
}

// ========== COMMAND MENU ==========

const char* benOS_commands[] = {
    "help", "version", "time", "synctime", "wifi", "wifiscan", "dig", "curl",
    "ping", "sysinfo", "speedtest", "passgen", "qrcode", "ascii", "cowsay",
    "weather", "stocks", "news", "webserver", "play", "fart", "timer",
    "calc", "write", "read", "delete", "ls", "image",
    "themes", "dnsstart", "dnsstop", "dnsstatus", "clear", "exit"
};
const int benOS_numCommands = 34;

int benOS_selectCommand(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
            tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
            
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("BenOS Command Menu", 160, 5);
            
            int startIdx = selected - 5;
            if (startIdx < 0) startIdx = 0;
            if (startIdx > benOS_numCommands - 10) startIdx = benOS_numCommands - 10;
            if (benOS_numCommands < 10) startIdx = 0;
            
            tft.setTextFont(2);
            tft.setTextDatum(CL_DATUM);
            
            for (int i = 0; i < 10 && (startIdx + i) < benOS_numCommands; i++) {
                int idx = startIdx + i;
                int y = 30 + i * 20;
                
                if (idx == selected) {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].bg, benOS_themes[benOS_currentTheme].fg);
                    tft.fillRect(5, y - 2, 310, 18, benOS_themes[benOS_currentTheme].fg);
                } else {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                }
                
                tft.drawString(benOS_commands[idx], 10, y + 7);
            }
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= benOS_numCommands) selected = benOS_numCommands - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            return selected;
        }
        lastBtn = btn;
        
        delay(50);
    }
}

