bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
// ========== TEXT INPUT (simplified) ==========

String benOS_textInput(TFT_eSPI &tft, String prompt) {
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(2);
    tft.setTextDatum(TC_DATUM);
    tft.drawString(prompt, 160, 10);
    
    tft.setTextDatum(TL_DATUM);
    tft.drawString("Use Serial Monitor to type", 10, 50);
    tft.drawString("Or press button to skip", 10, 70);
    
    String input = "";
    unsigned long startTime = millis();
    int lastBtn = HIGH;
    
    while (millis() - startTime < 10000) {
        while (Serial.available()) {
            char c = Serial.read();
            if (c == '\n' || c == '\r') {
                if (input.length() > 0) return input;
            } else {
                input += c;
                tft.fillRect(10, 100, 300, 30, benOS_themes[benOS_currentTheme].bg);
                tft.drawString(input, 10, 100);
            }
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            return "";
        }
        lastBtn = btn;
        
        delay(50);
    }
    
    return input;
}

// ========== URL SELECTION MENU ==========

struct URLExample {
    const char* name;
    const char* url;
};

URLExample benOS_urlExamples[] = {
    {"My Public IP", "http://api.ipify.org"},
    {"Random Dog Image", "http://dog.ceo/api/breeds/image/random"},
    {"IP Geolocation", "http://ip-api.com/json/"},
    {"Random Quote", "http://api.quotable.io/random"},
    {"Random Joke", "http://official-joke-api.appspot.com/random_joke"},
    {"ISS Location", "http://api.open-notify.org/iss-now.json"},
    {"Custom URL...", ""}
};

const int benOS_numURLExamples = sizeof(benOS_urlExamples) / sizeof(URLExample);

String benOS_urlInput(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    while (true) {
        if (selected != lastSelected) {
            tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
            tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
            
            tft.setTextFont(2);
            tft.setTextDatum(TC_DATUM);
            tft.drawString("Select URL or Custom", 160, 5);
            
            int startIdx = selected - 4;
            if (startIdx < 0) startIdx = 0;
            if (startIdx > benOS_numURLExamples - 8) startIdx = benOS_numURLExamples - 8;
            if (benOS_numURLExamples < 8) startIdx = 0;
            
            tft.setTextFont(2);
            tft.setTextDatum(CL_DATUM);
            
            for (int i = 0; i < 8 && (startIdx + i) < benOS_numURLExamples; i++) {
                int idx = startIdx + i;
                int y = 30 + i * 26;
                
if (idx == selected) {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].bg, benOS_themes[benOS_currentTheme].fg);
                    tft.fillRect(2, y - 2, 316, 22, benOS_themes[benOS_currentTheme].fg);
                } else {
                    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                }
                
                tft.drawString(benOS_urlExamples[idx].name, 6, y + 9);
            }
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= benOS_numURLExamples) selected = benOS_numURLExamples - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == benOS_numURLExamples - 1) {
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("Enter Custom URL", 160, 10);
                
                tft.setTextDatum(TL_DATUM);
                tft.drawString("Use Serial Monitor", 10, 50);
                tft.drawString("Or press button to cancel", 10, 70);
                
                String input = "";
                unsigned long startTime = millis();
                int lastBtnInner = HIGH;
                
                while (millis() - startTime < 15000) {
                    while (Serial.available()) {
                        char c = Serial.read();
                        if (c == '\n' || c == '\r') {
                            if (input.length() > 0) return input;
                        } else {
                            input += c;
                            tft.fillRect(10, 110, 300, 30, benOS_themes[benOS_currentTheme].bg);
                            tft.drawString(input.substring(0, 38), 10, 110);
                        }
                    }
                    
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        return "";
                    }
                    lastBtnInner = btnInner;
                    delay(50);
                }
                
                return "";
            } else {
                return String(benOS_urlExamples[selected].url);
            }
        }
        lastBtn = btn;
        
        delay(50);
    }
}
// ========== PING COMMAND ==========

struct PingHost {
    const char* name;
    const char* host;
};

PingHost benOS_pingHosts[] = {
    {"Google DNS", "8.8.8.8"},
    {"Cloudflare DNS", "1.1.1.1"},
    {"Google", "google.com"},
    {"GitHub", "github.com"},
    {"Router", "192.168.1.1"},
    {"Custom...", ""}
};

