bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
    WiFi.scanDelete();
}

// ========== SYSTEM INFO ==========

void benOS_sysinfo(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("=== System Information ===");
    benOS_addLine("");
    
    // Uptime
    unsigned long uptime = millis() / 1000;
    int hours = uptime / 3600;
    int mins = (uptime % 3600) / 60;
    int secs = uptime % 60;
    benOS_addLine("Uptime: " + String(hours) + "h " + String(mins) + "m " + String(secs) + "s");
    
    // Memory
    benOS_addLine("Free Heap: " + String(ESP.getFreeHeap() / 1024) + "KB");
    benOS_addLine("Total Heap: " + String(ESP.getHeapSize() / 1024) + "KB");
    benOS_addLine("Flash Size: " + String(ESP.getFlashChipSize() / 1024 / 1024) + "MB");
    
    // CPU
    benOS_addLine("CPU Freq: " + String(ESP.getCpuFreqMHz()) + "MHz");
    benOS_addLine("Chip: " + String(ESP.getChipModel()));
    benOS_addLine("Cores: " + String(ESP.getChipCores()));
    
    // WiFi
    if (WiFi.status() == WL_CONNECTED) {
        benOS_addLine("WiFi: Connected");
        benOS_addLine("IP: " + WiFi.localIP().toString());
        benOS_addLine("Signal: " + String(WiFi.RSSI()) + "dBm");
    } else {
        benOS_addLine("WiFi: Disconnected");
    }
    
    benOS_redrawScreen(tft);
}

// ========== SPEED TEST ==========

void benOS_speedtest(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("Network Speed Test");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Testing ping...");
    benOS_redrawScreen(tft);
    
    // Ping test
    IPAddress testIP;
    WiFi.hostByName("google.com", testIP);
    
    unsigned long pingStart = millis();
    bool pingSuccess = Ping.ping(testIP, 1);
    long pingTime = millis() - pingStart;
    
    if (pingSuccess) {
        benOS_addLine("Ping: " + String(pingTime) + "ms");
    } else {
        benOS_addLine("Ping: Failed");
    }
    
    benOS_addLine("");
    benOS_addLine("Testing download...");
    benOS_redrawScreen(tft);
    
    // Download test (small file)
    HTTPClient http;
    http.begin("http://ipv4.download.thinkbroadband.com/5MB.zip");
    
    unsigned long dlStart = millis();
    int code = http.GET();
    
    if (code == HTTP_CODE_OK) {
        WiFiClient * stream = http.getStreamPtr();
        uint8_t buff[128];
        int totalBytes = 0;
        
        while (http.connected() && totalBytes < 500000) {  // Test 500KB
            size_t size = stream->available();
            if (size) {
                int c = stream->readBytes(buff, min(size, sizeof(buff)));
                totalBytes += c;
            }
        }
        
        unsigned long dlTime = millis() - dlStart;
        float mbps = (totalBytes * 8.0) / (dlTime * 1000.0);
        
        benOS_addLine("Download: " + String(mbps, 1) + " Mbps");
        benOS_addLine("Downloaded: " + String(totalBytes / 1024) + "KB");
        benOS_addLine("Time: " + String(dlTime / 1000.0, 1) + "s");
    } else {
        benOS_addLine("Download test failed");
    }
    
    http.end();
    benOS_redrawScreen(tft);
}

// ========== PASSWORD GENERATOR ==========

void benOS_passgen(TFT_eSPI &tft) {
    const char* chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
    const char* symbols = "!@#$%^&*()-_=+[]{}|;:,.<>?";
    
    int lengths[] = {8, 12, 16, 20, 24};
    int selected = 2;  // Default 16
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    bool includeSymbols = true;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Password Generator");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine("Select length:");
            
            for (int i = 0; i < 5; i++) {
                String line = "  " + String(lengths[i]) + " characters";
                if (i == selected) line = "> " + String(lengths[i]) + " characters";
                benOS_addLine(line);
            }
            
            benOS_addLine("");
            benOS_addLine("Symbols: " + String(includeSymbols ? "Yes" : "No"));
            benOS_addLine("");
            benOS_addLine("Press button to generate");
            benOS_redrawScreen(tft);
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= 5) selected = 4;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Generate password
            String password = "";
            int len = lengths[selected];
            
            for (int i = 0; i < len; i++) {
                if (includeSymbols && random(100) < 20) {
                    password += symbols[random(strlen(symbols))];
                } else {
                    password += chars[random(strlen(chars))];
                }
            }
            
            benOS_clearScreen(tft);
            benOS_addLine("Generated Password:");
            benOS_addLine("===================");
            benOS_addLine("");
            
            // Display password in chunks
            for (int i = 0; i < password.length(); i += 20) {
                benOS_addLine(password.substring(i, min(i + 20, (int)password.length())));
            }
            
            benOS_addLine("");
            benOS_addLine("Length: " + String(len));
            benOS_addLine("Symbols: " + String(includeSymbols ? "Yes" : "No"));
            benOS_redrawScreen(tft);
            
            Serial.println("Generated password: " + password);
            return;
        }
        lastBtn = btn;
        
        delay(50);
    }
}

