bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= fileCount) selected = fileCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Display selected file
            File artFile = SD.open("/ascii/" + files[selected]);
            if (artFile) {
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(1);
                tft.setCursor(0, 0);
                
                while (artFile.available()) {
                    String line = artFile.readStringUntil('\n');
                    tft.println(line);
                }
                
                artFile.close();
                
                // Wait for button
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
            }
            
            return;
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== COWSAY ==========

void benOS_cowsay(TFT_eSPI &tft) {
    String message = benOS_textInput(tft, "Cow says:");
    if (message.length() == 0) message = "Hello from BenOS!";
    
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(1);
    tft.setCursor(10, 10);
    
    // Top border
    String border = " ";
    for (int i = 0; i < min((int)message.length() + 2, 50); i++) border += "_";
    tft.println(border);
    
    // Message
    tft.print("< ");
    tft.print(message.substring(0, 48));
    tft.println(" >");
    
    // Bottom border
    border = " ";
    for (int i = 0; i < min((int)message.length() + 2, 50); i++) border += "-";
    tft.println(border);
    
    // Cow
    tft.println("        \\   ^__^");
    tft.println("         \\  (oo)\\_______");
    tft.println("            (__)\\       )\\/\\");
    tft.println("                ||----w |");
    tft.println("                ||     ||");
    
    tft.setTextFont(2);
    tft.setTextDatum(BC_DATUM);
    tft.drawString("Press button to return", 160, 230);
    
    // Wait for button
    while (digitalRead(PIN_KO) == LOW) delay(10);
    delay(200);
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) break;
        lastBtn = btn;
        delay(50);
    }
}

// ========== WEATHER ==========

void benOS_weather(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("Weather");
    benOS_addLine("Newton Highlands, MA");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching...");
    benOS_redrawScreen(tft);
    
    // Using wttr.in simple weather API
    HTTPClient http;
    http.begin("http://wttr.in/Newton+Highlands+MA?format=%l:+%C+%t+%h+%w");
    http.setTimeout(10000);
    
    int code = http.GET();
    
    benOS_clearScreen(tft);
    benOS_addLine("Weather");
    benOS_addLine("Newton Highlands, MA");
    benOS_addLine("===================");
    benOS_addLine("");
    
    if (code == HTTP_CODE_OK) {
        String weather = http.getString();
        weather.trim();
        
        // Parse and display
        benOS_addLineWrapped(weather);
        
        // Get more detailed info
        http.end();
        http.begin("http://wttr.in/Newton+Highlands+MA?format=j1");
        code = http.GET();
        
        if (code == HTTP_CODE_OK) {
            String json = http.getString();
            
            // Simple parsing for current temp
            int tempIdx = json.indexOf("\"temp_F\":");
            if (tempIdx > 0) {
                String temp = json.substring(tempIdx + 10, tempIdx + 15);
                temp.trim();
                int commaIdx = temp.indexOf(',');
                if (commaIdx > 0) temp = temp.substring(0, commaIdx);
                temp.replace("\"", "");
                benOS_addLine("");
                benOS_addLine("Temperature: " + temp + " F");
            }
            
            // Humidity
            int humidIdx = json.indexOf("\"humidity\":");
            if (humidIdx > 0) {
                String humid = json.substring(humidIdx + 12, humidIdx + 17);
                humid.trim();
                int commaIdx = humid.indexOf(',');
                if (commaIdx > 0) humid = humid.substring(0, commaIdx);
                humid.replace("\"", "");
                benOS_addLine("Humidity: " + humid + "%");
            }
        }
    } else {
        benOS_addLine("Failed to fetch weather");
        benOS_addLine("Error: " + String(code));
    }
    
    http.end();
    benOS_redrawScreen(tft);
}

// ========== STOCK MARKET ==========

void benOS_stocks(TFT_eSPI &tft) {
    // Auto-sync time if not synced
    if (time(nullptr) < 100000) {
        benOS_clearScreen(tft);
        benOS_addLine("Syncing time first...");
        benOS_redrawScreen(tft);
        
        configTime(BenOS_Config::GMT_OFFSET, BenOS_Config::DAYLIGHT_OFFSET, BenOS_Config::NTP_SERVER);
        int attempts = 0;
        while (time(nullptr) < 100000 && attempts < 20) {
            delay(500);
            attempts++;
        }
    }
    
    benOS_clearScreen(tft);
    benOS_addLine("Stock Market");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching indices...");
    benOS_redrawScreen(tft);
    
    // Using Yahoo Finance alternative API
    const char* symbols[] = {"^GSPC", "^IXIC", "^DJI"};  // S&P 500, NASDAQ, Dow Jones
    const char* names[] = {"S&P 500", "NASDAQ", "Dow Jones"};
    
    benOS_clearScreen(tft);
    benOS_addLine("Stock Market Indices");
    benOS_addLine("===================");
    benOS_addLine("");
    
    for (int i = 0; i < 3; i++) {
        HTTPClient http;
        String url = "http://query1.finance.yahoo.com/v8/finance/chart/";
        url += symbols[i];
        url += "?interval=1d&range=1d";
        
        http.begin(url);
        http.setTimeout(5000);
        http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);  // Follow redirects
        
