bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
        int code = http.GET();
        
        if (code == HTTP_CODE_OK) {
            String response = http.getString();
            
            // Simple parse for current price
            int priceIdx = response.indexOf("\"regularMarketPrice\":");
            if (priceIdx > 0) {
                String price = response.substring(priceIdx + 21, priceIdx + 35);
                int commaIdx = price.indexOf(',');
                if (commaIdx > 0) price = price.substring(0, commaIdx);
                
                benOS_addLine(String(names[i]) + ":");
                benOS_addLine("  " + price);
            } else {
                benOS_addLine(String(names[i]) + ": N/A");
            }
        } else {
            benOS_addLine(String(names[i]) + ": Error " + String(code));
        }
        
        http.end();
        benOS_redrawScreen(tft);
        delay(500);
    }
    
    benOS_addLine("");
    benOS_addLine("Updated: " + benOS_getTime());
    benOS_redrawScreen(tft);
}

// ========== NEWS HEADLINES ==========

void benOS_news(TFT_eSPI &tft) {
    benOS_clearScreen(tft);
    benOS_addLine("News Headlines");
    benOS_addLine("===================");
    benOS_addLine("");
    benOS_addLine("Fetching...");
    benOS_redrawScreen(tft);
    
    HTTPClient http;
    // Using NewsAPI.org - you'll need to get a free API key
    // For demo, using a simple RSS-to-JSON service
    http.begin("http://api.rss2json.com/v1/api.json?rss_url=http://rss.cnn.com/rss/cnn_topstories.rss");
    http.setTimeout(10000);
    
    int code = http.GET();
    
    benOS_clearScreen(tft);
    benOS_addLine("Top News Headlines");
    benOS_addLine("===================");
    benOS_addLine("");
    
    if (code == HTTP_CODE_OK) {
        String json = http.getString();
        
        // Simple parsing for first 3 titles
        int titleCount = 0;
        int searchPos = 0;
        
        while (titleCount < 3 && searchPos < json.length()) {
            int titleIdx = json.indexOf("\"title\":\"", searchPos);
            if (titleIdx < 0) break;
            
            int titleStart = titleIdx + 9;
            int titleEnd = json.indexOf("\"", titleStart);
            
            if (titleEnd > titleStart) {
                String title = json.substring(titleStart, titleEnd);
                title.replace("\\u0027", "'");
                title.replace("\\\"", "\"");
                
                benOS_addLine(String(titleCount + 1) + ". " + title.substring(0, 35));
                if (title.length() > 35) {
                    benOS_addLine("   " + title.substring(35, min(70, (int)title.length())));
                }
                benOS_addLine("");
                
                titleCount++;
            }
            
            searchPos = titleEnd + 1;
        }
        
        if (titleCount == 0) {
            benOS_addLine("No headlines found");
        }
    } else {
        benOS_addLine("Failed to fetch news");
        benOS_addLine("Error: " + String(code));
    }
    
    http.end();
    benOS_redrawScreen(tft);
}

// ========== WEB SERVER ==========

WiFiServer* benOS_webServer = nullptr;
bool benOS_webServerRunning = false;

void benOS_webserver(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    const char* options[] = {"Start Server", "Stop Server", "Status"};
    const int numOptions = 3;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Web Server");
            benOS_addLine("===================");
            benOS_addLine("");
            benOS_addLine("Status: " + String(benOS_webServerRunning ? "Running" : "Stopped"));
            benOS_addLine("");
            
            for (int i = 0; i < numOptions; i++) {
                String line = (i == selected) ? "> " : "  ";
                line += options[i];
                benOS_addLine(line);
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= numOptions) selected = numOptions - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == 0 && !benOS_webServerRunning) {
                // Start server
                benOS_webServer = new WiFiServer(80);
                benOS_webServer->begin();
                benOS_webServerRunning = true;
                
                benOS_clearScreen(tft);
                benOS_addLine("Web Server Started");
                benOS_addLine("===================");
                benOS_addLine("");
                benOS_addLine("Access at:");
                benOS_addLine("http://" + WiFi.localIP().toString());
                benOS_addLine("");
                benOS_addLine("Serving files from /www/");
                benOS_addLine("");
                benOS_addLine("Running in background...");
                benOS_redrawScreen(tft);
                
                Serial.println("Web server started: http://" + WiFi.localIP().toString());
                return;
                
            } else if (selected == 1 && benOS_webServerRunning) {
                // Stop server
                if (benOS_webServer) {
                    benOS_webServer->stop();
                    delete benOS_webServer;
                    benOS_webServer = nullptr;
                }
                benOS_webServerRunning = false;
                
                benOS_clearScreen(tft);
                benOS_addLine("Web server stopped");
                benOS_redrawScreen(tft);
                delay(1000);
                return;
                
