bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
            } else if (selected == 2) {
                // Show status
                benOS_clearScreen(tft);
                benOS_addLine("Web Server Status");
                benOS_addLine("===================");
                benOS_addLine("");
                
                if (benOS_webServerRunning) {
                    benOS_addLine("Status: Running");
                    benOS_addLine("URL: http://" + WiFi.localIP().toString());
                    benOS_addLine("Port: 80");
                } else {
                    benOS_addLine("Status: Stopped");
                }
                
                benOS_redrawScreen(tft);
                delay(2000);
                return;
            }
        }
        lastBtn = btn;
        delay(50);
    }
}


// Forward declarations for web server functions
void serve404(WiFiClient &client);
void serveFile(WiFiClient &client, const char *path);
void serveStatus(WiFiClient &client);
void serveCommand(WiFiClient &client, String path);

// ========== ENHANCED WEB SERVER WITH API ==========

void benOS_processWebServer() {
    if (!benOS_webServerRunning || !benOS_webServer) return;
    
    WiFiClient client = benOS_webServer->available();
    if (client) {
        String request = "";
        String firstLine = "";
        
        while (client.connected()) {
            if (client.available()) {
                char c = client.read();
                request += c;
                
                if (firstLine == "" && c == '\n') {
                    // Capture first line
                    int endOfLine = request.indexOf('\n');
                    if (endOfLine > 0) {
                        firstLine = request.substring(0, endOfLine);
                    }
                }
                
                if (c == '\n' && request.endsWith("\r\n\r\n")) {
                    break;
                }
            }
        }
        
        // Parse request path
        String path = "/";
        int pathStart = firstLine.indexOf("GET ") + 4;
        int pathEnd = firstLine.indexOf(" HTTP");
        if (pathStart > 3 && pathEnd > pathStart) {
            path = firstLine.substring(pathStart, pathEnd);
        }
        
        Serial.println("Web request: " + path);
        
        // Route requests
        if (path == "/" || path == "/index.html") {
            serveFile(client, "/www/index.html");
        }
        else if (path == "/api/status") {
            serveStatus(client);
        }
        else if (path.startsWith("/api/command")) {
            serveCommand(client, path);
        }
        else if (path == "/api/reboot") {
            client.println("HTTP/1.1 200 OK");
            client.println("Content-Type: text/plain");
            client.println("Connection: close");
            client.println();
            client.println("Rebooting...");
            client.stop();
            delay(1000);
            ESP.restart();
        }
        else {
            serve404(client);
        }
        
        client.stop();
    }
}

void serveFile(WiFiClient &client, const char* filepath) {
    if (!SD.exists(filepath)) {
        serve404(client);
        return;
    }
    
    File file = SD.open(filepath);
    if (!file) {
        serve404(client);
        return;
    }
    
    client.println("HTTP/1.1 200 OK");
    if (String(filepath).endsWith(".html")) {
        client.println("Content-Type: text/html");
    } else if (String(filepath).endsWith(".css")) {
        client.println("Content-Type: text/css");
    } else if (String(filepath).endsWith(".js")) {
        client.println("Content-Type: application/javascript");
    }
    client.println("Connection: close");
    client.println();
    
    while (file.available()) {
        client.write(file.read());
    }
    
    file.close();
}

void serveStatus(WiFiClient &client) {
    // Build JSON status
    unsigned long uptime = millis() / 1000;
    int hours = uptime / 3600;
    int mins = (uptime % 3600) / 60;
    
    String json = "{";
    json += "\"uptime\":\"" + String(hours) + "h " + String(mins) + "m\",";
    json += "\"freeHeap\":\"" + String(ESP.getFreeHeap() / 1024) + " KB\",";
    json += "\"totalHeap\":\"" + String(ESP.getHeapSize() / 1024) + " KB\",";
    json += "\"ramPercent\":" + String(100 - (ESP.getFreeHeap() * 100 / ESP.getHeapSize())) + ",";
    json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"mac\":\"" + WiFi.macAddress() + "\",";
    json += "\"ssid\":\"" + WiFi.SSID() + "\",";
    json += "\"rssi\":\"" + String(WiFi.RSSI()) + " dBm\",";
    json += "\"dnsRunning\":" + String(benOS_dnsServerRunning ? "true" : "false");
    json += "}";
    
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: application/json");
    client.println("Connection: close");
    client.println();
    client.println(json);
}

void serveCommand(WiFiClient &client, String path) {
    // Extract command parameter
    int cmdStart = path.indexOf("cmd=") + 4;
    String cmd = "";
    
    if (cmdStart > 3) {
        int cmdEnd = path.indexOf("&", cmdStart);
        if (cmdEnd < 0) cmdEnd = path.length();
        cmd = path.substring(cmdStart, cmdEnd);
        
        // URL decode
        cmd.replace("%20", " ");
        cmd.replace("+", " ");
    }
    
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: text/plain");
    client.println("Connection: close");
    client.println();
    
    if (cmd.length() > 0) {
        client.println("Executing: " + cmd);
        client.println("Command sent to BenOS");
        client.println("Check device display for output");
        
        Serial.println("Web command received: " + cmd);
    } else {
        client.println("Error: No command specified");
    }
}

void serve404(WiFiClient &client) {
    client.println("HTTP/1.1 404 Not Found");
    client.println("Content-Type: text/html");
    client.println("Connection: close");
    client.println();
    client.println("<!DOCTYPE HTML>");
    client.println("<html><body style='background:#000;color:#0f0;font-family:monospace;'>");
    client.println("<h1>404 - Not Found</h1>");
    client.println("<p>The requested resource was not found on this server.</p>");
    client.println("<a href='/' style='color:#0f0;'>Return to BenOS Control Panel</a>");
    client.println("</body></html>");
}
// ========== MUSIC PLAYER ==========

