bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                if (i == selected) {
                    tft.fillRoundRect(x, y, buttonW, buttonH, 8, TFT_GREEN);
                    tft.setTextColor(TFT_BLACK, TFT_GREEN);
                } else {
                    tft.fillRoundRect(x, y, buttonW, buttonH, 8, 0x8410);
                    tft.setTextColor(TFT_WHITE, 0x8410);
                }
                
                tft.setTextDatum(MC_DATUM);
                String label = "Fart " + String(i + 1);
                tft.drawString(label, x + buttonW / 2, y + buttonH / 2);
            }
            
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(1);
            tft.setTextDatum(BC_DATUM);
            tft.drawString("Rotate=Select | Press=Play | Hold=Exit", 160, 230);
            
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= fileCount) selected = fileCount - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        
        // Detect button hold for exit
        if (btn == LOW && lastBtn == HIGH) {
            btnHoldStart = millis();
            btnHeld = false;
        }
        
        if (btn == LOW && millis() - btnHoldStart > 1000 && !btnHeld) {
            // Button held for 1 second - EXIT
            btnHeld = true;
            tft.fillScreen(0x4208);
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(2);
            tft.setTextDatum(MC_DATUM);
            tft.drawString("Exiting Fart Board...", 160, 120);
            delay(500);
            return;
        }
        
        if (btn == HIGH && lastBtn == LOW && !btnHeld) {
            // Quick press - play sound
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            // Play selected fart sound
            String filepath = "/sounds/farts/" + files[selected];
            
            // Show playing animation
            tft.fillRect(0, 100, 320, 40, 0x4208);
            tft.setTextColor(TFT_YELLOW, 0x4208);
            tft.setTextFont(4);
            tft.setTextDatum(MC_DATUM);
            tft.drawString("PFFFFFFFFFFT!", 160, 120);
            
            playSound(filepath.c_str(), true);
            
            // Wait for playback to finish
            extern AudioGeneratorWAV *wav;
            while (wav && wav->isRunning()) {
                updateAudio();
                delay(10);
            }
            
            delay(500);
            lastSelected = -1;  // Force redraw
        }
        
        lastBtn = btn;
        delay(50);
    }
}

// ========== TIMER / STOPWATCH ==========

void benOS_timer(TFT_eSPI &tft) {
    int selected = 0;
    int lastSelected = -1;
    int lastRotary = rotaryPos;
    int lastBtn = HIGH;
    
    const char* options[] = {"Stopwatch", "Timer 1 min", "Timer 3 min", "Timer 5 min", "Timer 10 min", "Custom Timer"};
    const int numOptions = 6;
    
    while (true) {
        if (selected != lastSelected) {
            benOS_clearScreen(tft);
            benOS_addLine("Timer / Stopwatch");
            benOS_addLine("===================");
            benOS_addLine("");
            
            for (int i = 0; i < numOptions; i++) {
                String line = (i == selected) ? "> " : "  ";
                line += options[i];
                benOS_addLine(line);
            }
            
            benOS_redrawScreen(tft);
            lastSelected = selected;
        }
        
        int rotDiff = rotaryPos - lastRotary;
        if (rotDiff > 2) {
            selected++;
            if (selected >= numOptions) selected = numOptions - 1;
            lastRotary = rotaryPos;
        } else if (rotDiff < -2) {
            selected--;
            if (selected < 0) selected = 0;
            lastRotary = rotaryPos;
        }
        
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            if (selected == 0) {
                // STOPWATCH MODE
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("STOPWATCH", 160, 10);
                
                unsigned long startTime = millis();
                bool running = true;
                int lastBtnInner = HIGH;
                
                while (running) {
                    unsigned long elapsed = millis() - startTime;
                    int minutes = elapsed / 60000;
                    int seconds = (elapsed / 1000) % 60;
                    int hundredths = (elapsed / 10) % 100;
                    
                    char timeStr[12];
                    sprintf(timeStr, "%02d:%02d.%02d", minutes, seconds, hundredths);
                    
                    tft.fillRect(0, 80, 320, 80, benOS_themes[benOS_currentTheme].bg);
                    tft.setTextFont(7);
                    tft.setTextDatum(MC_DATUM);
                    tft.drawString(String(timeStr), 160, 120);
                    
                    tft.setTextFont(2);
                    tft.setTextDatum(BC_DATUM);
                    tft.drawString("Press button to stop", 160, 220);
                    
                    // Check for button press
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        running = false;
                    }
                    lastBtnInner = btnInner;
                    
                    delay(10);
                }
                
