bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                // Show final time
                tft.fillRect(0, 200, 320, 40, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.drawString("STOPPED - Press to continue", 160, 220);
                
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
                
                return;
                
            } else {
                // TIMER MODE
                int timerMinutes = 0;
                
                if (selected == 1) timerMinutes = 1;
                else if (selected == 2) timerMinutes = 3;
                else if (selected == 3) timerMinutes = 5;
                else if (selected == 4) timerMinutes = 10;
                else if (selected == 5) {
                    // Custom timer - use rotary to set
                    int customMin = 1;
                    int lastCustom = -1;
                    int lastRotaryCustom = rotaryPos;
                    int lastBtnCustom = HIGH;
                    
                    while (true) {
                        if (customMin != lastCustom) {
                            benOS_clearScreen(tft);
                            benOS_addLine("Set Timer Duration");
                            benOS_addLine("===================");
                            benOS_addLine("");
                            benOS_addLine("Minutes: " + String(customMin));
                            benOS_addLine("");
                            benOS_addLine("Rotate to adjust");
                            benOS_addLine("Press to start");
                            benOS_redrawScreen(tft);
                            lastCustom = customMin;
                        }
                        
                        int rotDiff = rotaryPos - lastRotaryCustom;
                        if (rotDiff > 2) {
                            customMin++;
                            if (customMin > 60) customMin = 60;
                            lastRotaryCustom = rotaryPos;
                        } else if (rotDiff < -2) {
                            customMin--;
                            if (customMin < 1) customMin = 1;
                            lastRotaryCustom = rotaryPos;
                        }
                        
                        int btnCustom = digitalRead(PIN_KO);
                        if (btnCustom == LOW && lastBtnCustom == HIGH) {
                            while (digitalRead(PIN_KO) == LOW) delay(10);
                            delay(200);
                            timerMinutes = customMin;
                            break;
                        }
                        lastBtnCustom = btnCustom;
                        delay(50);
                    }
                }
                
                // Run timer
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(TC_DATUM);
                tft.drawString("TIMER", 160, 10);
                
                unsigned long endTime = millis() + (timerMinutes * 60000);
                bool running = true;
                int lastBtnInner = HIGH;
                
                while (running && millis() < endTime) {
                    unsigned long remaining = endTime - millis();
                    int minutes = remaining / 60000;
                    int seconds = (remaining / 1000) % 60;
                    
                    char timeStr[8];
                    sprintf(timeStr, "%02d:%02d", minutes, seconds);
                    
                    tft.fillRect(0, 80, 320, 80, benOS_themes[benOS_currentTheme].bg);
                    tft.setTextFont(7);
                    tft.setTextDatum(MC_DATUM);
                    tft.drawString(String(timeStr), 160, 120);
                    
                    // Progress bar
                    int barWidth = (int)(280 * (1.0 - (float)remaining / (timerMinutes * 60000)));
                    tft.fillRect(20, 180, barWidth, 20, TFT_GREEN);
                    tft.drawRect(20, 180, 280, 20, benOS_themes[benOS_currentTheme].fg);
                    
                    tft.setTextFont(2);
                    tft.setTextDatum(BC_DATUM);
                    tft.drawString("Press button to cancel", 160, 220);
                    
                    // Check for button press to cancel
                    int btnInner = digitalRead(PIN_KO);
                    if (btnInner == LOW && lastBtnInner == HIGH) {
                        running = false;
                        
                        benOS_clearScreen(tft);
                        benOS_addLine("Timer cancelled");
                        benOS_redrawScreen(tft);
                        delay(1000);
                        return;
                    }
                    lastBtnInner = btnInner;
                    
                    delay(100);
                }
                
                // Timer finished - alert!
                tft.fillScreen(TFT_RED);
                tft.setTextColor(TFT_WHITE, TFT_RED);
                tft.setTextFont(4);
                tft.setTextDatum(MC_DATUM);
                
                // Play alert sound if available
                if (SD.exists("/sounds/alert.wav")) {
                    playSound("/sounds/alert.wav", true);
                }
                
                // Flash display
                for (int i = 0; i < 10; i++) {
                    tft.fillScreen((i % 2 == 0) ? TFT_RED : TFT_YELLOW);
                    tft.setTextColor((i % 2 == 0) ? TFT_WHITE : TFT_BLACK, (i % 2 == 0) ? TFT_RED : TFT_YELLOW);
                    tft.drawString("TIME'S UP!", 160, 120);
                    delay(300);
                }
                
