bdash9/ESP32-Rotary_Game_System/Rotary_Game_System/BenOS.h
                tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
                tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
                tft.setTextFont(2);
                tft.setTextDatum(MC_DATUM);
                tft.drawString("Timer finished!", 160, 120);
                tft.drawString("Press button to continue", 160, 150);
                
                while (digitalRead(PIN_KO) == LOW) delay(10);
                delay(200);
                lastBtn = HIGH;
                while (true) {
                    int btn = digitalRead(PIN_KO);
                    if (btn == LOW && lastBtn == HIGH) break;
                    lastBtn = btn;
                    delay(50);
                }
                
                return;
            }
        }
        lastBtn = btn;
        delay(50);
    }
}

// ========== MAIN RUN FUNCTION ==========

void run_BenOS(TFT_eSPI &tft) {
    tft.setRotation(3);
    
    // Splash screen - draw directly to screen, not using buffer
    tft.fillScreen(benOS_themes[benOS_currentTheme].bg);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    tft.setTextFont(2);
    tft.setTextDatum(TL_DATUM);
    
    int y = 10;  // Start from top with padding
    
    // Simple BenOS logo
    tft.drawString(" ___             ___  ___ ", 10, y); y += 16;
    tft.drawString(" | _ )  ___ _ _/  _ \\/ __|", 10, y); y += 16;
    tft.drawString(" | _  \\/ -_)' \\|   (_) |\\__ \\", 10, y); y += 16;
    tft.drawString(" |___/\\___|_||_|\\___/|___/", 10, y); y += 16;
    
    y += 16;  // Extra space
    tft.drawString(BenOS_Config::OS_VERSION, 10, y); y += 16;
    tft.drawString("A Mini Terminal OS", 10, y); y += 16;
    
    y += 8;
    tft.drawString("Chip: ESP32-WROVER", 10, y); y += 16;
    tft.drawString("Features: WiFi, BT, Dual Core", 10, y); y += 16;
    tft.drawString("240MHz, 40MHz Crystal", 10, y); y += 16;
    tft.drawString("MAC: 10:97:bd:d1:f9:e4", 10, y); y += 16;
    
    y += 16;
    tft.setTextColor(TFT_YELLOW, benOS_themes[benOS_currentTheme].bg);
    tft.drawString("Press button to continue...", 10, y);
    tft.setTextColor(benOS_themes[benOS_currentTheme].fg, benOS_themes[benOS_currentTheme].bg);
    
    // Wait for button to be RELEASED first (if pressed from menu)
    while (digitalRead(PIN_KO) == LOW) {
        delay(10);
    }
    delay(300);  // Debounce delay
    
    // Now wait for a fresh button press
    int lastBtn = HIGH;
    while (true) {
        int btn = digitalRead(PIN_KO);
        if (btn == LOW && lastBtn == HIGH) {
            break;  // Button pressed!
        }
        lastBtn = btn;
        delay(50);
    }
    
    // Wait for button release
    while (digitalRead(PIN_KO) == LOW) {
        delay(10);
    }
    delay(200);  // Final debounce
        
// Main command loop
bool exitOS = false;
while (!exitOS) {
    // Process DNS requests in background
    benOS_processDNSRequest();
    
    // Process web server requests
    benOS_processWebServer();  // ← ADD THIS NEW LINE
    
    int cmdIdx = benOS_selectCommand(tft);
    String cmd = benOS_commands[cmdIdx];
                
        benOS_clearScreen(tft);
        benOS_addLine("> " + cmd);
        
if (cmd == "help") {
            benOS_showHelp(tft);
        }
        else if (cmd == "version") {
            benOS_addLine(BenOS_Config::OS_VERSION);
            benOS_redrawScreen(tft);
        }
        else if (cmd == "time") {
            benOS_addLine(benOS_getTime());
            benOS_redrawScreen(tft);
        }
        else if (cmd == "synctime") {
            if (benOS_ensureWiFi(tft)) {
                benOS_clearScreen(tft);
                benOS_addLine("> synctime");
                benOS_syncTime(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "wifi") {
            benOS_connectWiFi(tft);
        }
        else if (cmd == "wifiscan") {
            benOS_wifiScan(tft);
        }
        else if (cmd == "sysinfo") {
            benOS_sysinfo(tft);
        }
        else if (cmd == "ping") {
            if (benOS_ensureWiFi(tft)) {
                String host = benOS_selectPingHost(tft);
                if (host.length() > 0) {
                    benOS_ping(tft, host);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "speedtest") {
            if (benOS_ensureWiFi(tft)) {
                benOS_speedtest(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "passgen") {
            benOS_passgen(tft);
        }
        else if (cmd == "qrcode") {
            benOS_qrcode(tft);
        }
        else if (cmd == "ascii") {
            benOS_ascii(tft);
        }
        else if (cmd == "cowsay") {
            benOS_cowsay(tft);
        }
        else if (cmd == "weather") {
            if (benOS_ensureWiFi(tft)) {
                benOS_weather(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "stocks") {
            if (benOS_ensureWiFi(tft)) {
                benOS_stocks(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "news") {
            if (benOS_ensureWiFi(tft)) {
                benOS_news(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "webserver") {
            if (benOS_ensureWiFi(tft)) {
                benOS_webserver(tft);
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "play") {
            benOS_play(tft);
        }
        else if (cmd == "fart") {
            benOS_fart(tft);
        }
        else if (cmd == "timer") {
            benOS_timer(tft);
        }
        else if (cmd == "dig") {
            if (benOS_ensureWiFi(tft)) {
                String hostname = benOS_hostnameInput(tft);
                if (hostname.length() > 0) {
                    benOS_dig(tft, hostname);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "curl") {
            if (benOS_ensureWiFi(tft)) {
                String url = benOS_urlInput(tft);
                if (url.length() > 0) {
                    benOS_clearScreen(tft);
                    benOS_addLine("> curl " + url);
                    benOS_curl(tft, url);
                }
            } else {
                benOS_clearScreen(tft);
                benOS_addLine("WiFi connection failed");
                benOS_redrawScreen(tft);
            }
        }
        else if (cmd == "calc") {
            String expr = benOS_textInput(tft, "Enter expression:");
            if (expr.length() > 0) {
                benOS_clearScreen(tft);
                benOS_addLine("> calc " + expr);
                benOS_calc(tft, expr);
            }
        }
        else if (cmd == "write") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                String data = benOS_textInput(tft, "Data:");
                if (data.length() > 0) {
                    benOS_clearScreen(tft);
                    benOS_writeFile(tft, filename, data);
                }
            }
        }
        else if (cmd == "read") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                benOS_clearScreen(tft);
                benOS_readFile(tft, filename);
            }
        }
        else if (cmd == "delete") {
            String filename = benOS_textInput(tft, "Filename:");
            if (filename.length() > 0) {
                benOS_clearScreen(tft);
                benOS_deleteFile(tft, filename);
            }
        }
        else if (cmd == "ls") {
            benOS_listFiles(tft);
        }
        else if (cmd == "image") {
            benOS_showImage(tft, "/ben.jpg");
            benOS_clearScreen(tft);
        }
        else if (cmd == "themes") {
            benOS_selectTheme(tft);
            benOS_clearScreen(tft);
            benOS_addLine("Theme changed!");
            benOS_redrawScreen(tft);
        }
        else if (cmd == "dnsstart") {
            benOS_startDNSServer(tft);
        }
        else if (cmd == "dnsstop") {
            benOS_stopDNSServer(tft);
        }
        else if (cmd == "dnsstatus") {
            benOS_dnsServerStatus(tft);
        }
        else if (cmd == "clear") {
            benOS_clearScreen(tft);
        }
        else if (cmd == "exit") {
            exitOS = true;
            break;
        }
        
        if (!exitOS && cmd != "image" && cmd != "themes" && cmd != "play" && cmd != "fart" && cmd != "timer" && cmd != "ascii" && cmd != "cowsay" && cmd != "qrcode") {
            benOS_addLine("");
            benOS_addLine("Press button to continue...");
            benOS_redrawScreen(tft);
            
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
            
            lastBtn = HIGH;
            while (true) {
                int btn = digitalRead(PIN_KO);
                if (btn == LOW && lastBtn == HIGH) break;
                lastBtn = btn;
                delay(50);
            }
            
            while (digitalRead(PIN_KO) == LOW) delay(10);
            delay(200);
        }
    
    tft.fillScreen(TFT_BLACK);
}
}
#endif // BENOS_H